app/controllers/groups_controller.rb

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "laptops"], ["description", "a list of curated laptops"], ["created_at", "2022-12-08 02:37:29.033023"], ["updated_at", "2022-12-08 02:37:29.033023"]]
---
  def create
    category = Category.create!(category_params)